#+title: snap-syllabus
#+author: Marcus Birkenkrahe
#+startup: overview hideblocks indent
#+options: toc:1 num:1 ^:nil
#+subtitle: COR100 Snap! Programming Syllabus
** Grading system

The table lists course requirements, number of units (classroom
sessions), points-per-unit (PPU), total points per requirement, and
the impact of a requirement on your total grade.

#+name: tbl:grading
| REQUIREMENT | UNITS | PPU | TOTAL | % of TOTAL |
|-------------+-------+-----+-------+------------|
| Quizzes     |    10 |   5 |    50 |        20. |
| Programs    |     5 |  10 |    50 |        20. |
| Classwork   |    10 |   5 |    50 |        20. |
| Exams       |     2 |  25 |    50 |        20. |
| Project     |     2 |  25 |    50 |        20. |
| HATS        |     2 |  25 |    50 |        20. |
|-------------+-------+-----+-------+------------|
| TOTAL       |       |     |   250 |       100. |
|-------------+-------+-----+-------+------------|
#+TBLFM: @2$4=$2*$3::@2$5=(@2$4/@8$4)*100::@3$4=$2*$3::@3$5=(@3$4/@8$4)*100::@4$4=$2*$3::@4$5=(@4$4/@8$4)*100::@5$4=$2*$3::@5$5=(@5$4/@8$4)*100::@6$4=$2*$3::@6$5=(@6$4/@8$4)*100::@7$4=$2*$3::@7$5=(@7$4/@8$4)*100::@8$4=vsum(@2..@6)::@8$5=vsum(@2..@6)

You should be able to see your current grade at any time using the
Canvas gradebook for the course.

*** Grading table

This table is used to convert completion rates into letter grades. For
the midterm results, letter grades still carry signs, while for the
term results, only straight letters are given (by rounding up).

|--------+---------------+---------------+--------|
|      % | MIDTERM GRADE | FINAL GRADE   | POINTS |
|--------+---------------+---------------+--------|
| 100-98 | A+            |               |        |
|  97-96 | A             | A (passed -   |        |
|  95-90 | A-            | very good)    |   225. |
|--------+---------------+---------------+--------|
|  89-86 | B+            |               |        |
|  85-80 | B             | B (passed -   |        |
|  79-76 | B-            | good)         |   190. |
|--------+---------------+---------------+--------|
|  75-70 | C+            |               |        |
|  69-66 | C             | C (passed -   |        |
|  65-60 | C-            | satisfactory) |   150. |
|--------+---------------+---------------+--------|
|  59-56 | D+            |               |        |
|  55-50 | D             | D (passed)    |   125. |
|--------+---------------+---------------+--------|
|   49-0 | F             | F (failed)    |        |
|--------+---------------+---------------+--------|
#+TBLFM: @4$4=0.9*250::@7$4=0.76*250::@10$4=0.6*250::@12$4=.50*250

